void main(List<String> args) {
  /***
   * 
   * 请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。

数字 1-9 在每一行只能出现一次。
数字 1-9 在每一列只能出现一次。
数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）

作者：力扣 (LeetCode)
链接：https://leetcode.cn/leetbook/read/top-interview-questions-easy/x2f9gg/
来源：力扣（LeetCode）
著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
   * 
   * board = 
[["8","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]

作者：力扣 (LeetCode)
链接：https://leetcode.cn/leetbook/read/top-interview-questions-easy/x2f9gg/
来源：力扣（LeetCode）
著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
  */

  var board = [
    ["8", "3", ".", ".", "7", ".", ".", ".", "."],
    ["6", ".", ".", "1", "9", "5", ".", ".", "."],
    [".", "9", "8", ".", ".", ".", ".", "6", "."],
    ["8", ".", ".", ".", "6", ".", ".", ".", "3"],
    ["4", ".", ".", "8", ".", "3", ".", ".", "1"],
    ["7", ".", ".", ".", "2", ".", ".", ".", "6"],
    [".", "6", ".", ".", ".", ".", "2", "8", "."],
    [".", ".", ".", "4", "1", "9", ".", ".", "5"],
    [".", ".", ".", ".", "8", ".", ".", "7", "9"]
  ];

  print(isValidSudoku(board));
}

bool isValidSudoku(List<List<String>> board) {
  // int length = board.length;

  List<List<String>> line = [];
  List<List<String>> column = [];
  List<List<String>> cell = [];

  for (var i = 0; i < board.length; i++) {
    for (var j = 0; j < board.length; j++) {
      if (board[i][j] == ".") {
        continue;
      }
      int num = int.parse(board[i][j]);
      print(num);
      //k是第几个单元格，9宫格数独横着和竖着都是3个单元格
      double k1 = i / 3 * 3 + j / 3;
      int k = k1.toInt();
      print("k=$k");
      //如果当前数字对应的行和列以及单元格，只要一个由数字，说明冲突了，直接返回false。
      //举个例子，如果line[i][num]不等于0，说明第i（i从0开始）行有num这个数字。
      // if (line[i][num] != 0 || column[j][num] != 0 || cell[k][num] != 0)
      //   return false;
      // //表示第i行有num这个数字，第j列有num这个数字，对应的单元格内也有num这个数字
      // line[i][num] = column[j][num] = cell[k][num] = "1";
    }
  }

  return true;
}
